qu1j0t3/yamaha_dac_y3014b/board/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*! @name PORTH6 (number 4), DAC_SD_Y_COEFF/J3[11]/PTH6_GPIO10
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_DAC_SD_Y_COEFF_FGPIO FGPIOB             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_DAC_SD_Y_COEFF_GPIO GPIOB               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_DAC_SD_Y_COEFF_GPIO_PORT kGPIO_PORTH    /*!<@brief PORTB GPIO port: PORTB */
#define BOARD_INITPINS_DAC_SD_Y_COEFF_GPIO_PIN_MASK (1U << 30U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_DAC_SD_Y_COEFF_PORT PORTH               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_DAC_SD_Y_COEFF_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_DAC_SD_Y_COEFF_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                               /* @} */

/*! @name PORTE6 (number 20), DAC_SD_X_COEFF/J1[13]/PTE6_LED2
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_DAC_SD_X_COEFF_FGPIO FGPIOB             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_DAC_SD_X_COEFF_GPIO GPIOB               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_DAC_SD_X_COEFF_GPIO_PORT kGPIO_PORTE    /*!<@brief PORTB GPIO port: PORTB */
#define BOARD_INITPINS_DAC_SD_X_COEFF_GPIO_PIN_MASK (1U << 6U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_DAC_SD_X_COEFF_PORT PORTE               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_DAC_SD_X_COEFF_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_DAC_SD_X_COEFF_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                               /* @} */

/*! @name PORTE5 (number 21), DAC_CLOCK/J1[15]/PTE5_LED3
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_DAC_CLOCK_FGPIO FGPIOB             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_DAC_CLOCK_GPIO GPIOB               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_DAC_CLOCK_GPIO_PORT kGPIO_PORTE    /*!<@brief PORTB GPIO port: PORTB */
#define BOARD_INITPINS_DAC_CLOCK_GPIO_PIN_MASK (1U << 5U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_DAC_CLOCK_PORT PORTE               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_DAC_CLOCK_PIN 5U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_DAC_CLOCK_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PORTC3 (number 24), Y_INT_RESET/J3[10]/PTC3_A4
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_Y_INT_RESET_FGPIO FGPIOA             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_Y_INT_RESET_GPIO GPIOA               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_Y_INT_RESET_GPIO_PORT kGPIO_PORTC    /*!<@brief PORTA GPIO port: PORTA */
#define BOARD_INITPINS_Y_INT_RESET_GPIO_PIN_MASK (1U << 19U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_Y_INT_RESET_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_Y_INT_RESET_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_Y_INT_RESET_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name PORTC2 (number 25), X_INT_RESET/J3[8]/PTC2_A3
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_X_INT_RESET_FGPIO FGPIOA             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_X_INT_RESET_GPIO GPIOA               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_X_INT_RESET_GPIO_PORT kGPIO_PORTC    /*!<@brief PORTA GPIO port: PORTA */
#define BOARD_INITPINS_X_INT_RESET_GPIO_PIN_MASK (1U << 18U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_X_INT_RESET_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_X_INT_RESET_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_X_INT_RESET_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name PORTD7 (number 26), Y_INT_HOLD/J1[5]/PTD7_TXD2
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_Y_INT_HOLD_FGPIO FGPIOA             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_Y_INT_HOLD_GPIO GPIOA               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_Y_INT_HOLD_GPIO_PORT kGPIO_PORTD    /*!<@brief PORTA GPIO port: PORTA */
#define BOARD_INITPINS_Y_INT_HOLD_GPIO_PIN_MASK (1U << 31U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_Y_INT_HOLD_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_Y_INT_HOLD_PIN 7U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_Y_INT_HOLD_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*! @name PORTD6 (number 27), X_INT_HOLD/J1[7]/PTD6_RXD2
  @{ */

