qu1j0t3/yamaha_dac_y3014b/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_X_INT_HOLD_FGPIO FGPIOA             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_X_INT_HOLD_GPIO GPIOA               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_X_INT_HOLD_GPIO_PORT kGPIO_PORTD    /*!<@brief PORTA GPIO port: PORTA */
#define BOARD_INITPINS_X_INT_HOLD_GPIO_PIN_MASK (1U << 30U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_X_INT_HOLD_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_X_INT_HOLD_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_X_INT_HOLD_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*! @name PORTC0 (number 32), TRIGGER/J3[4]/PTC0_A1
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_TRIGGER_FGPIO FGPIOA             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_TRIGGER_GPIO GPIOA               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_TRIGGER_GPIO_PORT kGPIO_PORTC    /*!<@brief PORTA GPIO port: PORTA */
#define BOARD_INITPINS_TRIGGER_GPIO_PIN_MASK (1U << 16U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_TRIGGER_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_TRIGGER_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_TRIGGER_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PORTC5 (number 77), Z_BLANK/J1[11]/PTC5_T2
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_Z_BLANK_FGPIO FGPIOA             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_Z_BLANK_GPIO GPIOA               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_Z_BLANK_GPIO_PORT kGPIO_PORTC    /*!<@brief PORTA GPIO port: PORTA */
#define BOARD_INITPINS_Z_BLANK_GPIO_PIN_MASK (1U << 21U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_Z_BLANK_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_Z_BLANK_PIN 5U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_Z_BLANK_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PORTE4 (number 47), DAC_LOAD/J1[9]/PTE4_GPIO1
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_DAC_LOAD_FGPIO FGPIOB             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_DAC_LOAD_GPIO GPIOB               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_DAC_LOAD_GPIO_PORT kGPIO_PORTE    /*!<@brief PORTB GPIO port: PORTB */
#define BOARD_INITPINS_DAC_LOAD_GPIO_PIN_MASK (1U << 4U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_DAC_LOAD_PORT PORTE               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_DAC_LOAD_PIN 4U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_DAC_LOAD_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PORTA0 (number 62), J2[2]/PTA0_D8_T0
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_NOTCS_DAC_POS_FGPIO FGPIOA             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_NOTCS_DAC_POS_GPIO GPIOA               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_NOTCS_DAC_POS_GPIO_PORT kGPIO_PORTA    /*!<@brief PORTA GPIO port: PORTA */
#define BOARD_INITPINS_NOTCS_DAC_POS_GPIO_PIN_MASK (1U << 0U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_NOTCS_DAC_POS_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_NOTCS_DAC_POS_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_NOTCS_DAC_POS_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PORTE0 (number 76), J4[1]/PTE0_SPI0_SCK
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SPI_CLOCK_FGPIO FGPIOB             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_SPI_CLOCK_GPIO GPIOB               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_SPI_CLOCK_GPIO_PORT kGPIO_PORTE    /*!<@brief PORTB GPIO port: PORTB */
#define BOARD_INITPINS_SPI_CLOCK_GPIO_PIN_MASK (1U << 0U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_SPI_CLOCK_PORT PORTE               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SPI_CLOCK_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SPI_CLOCK_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PORTE1 (number 75), J4[3]/PTE1_SPI0_MOSI
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SPI_DATAOUT_FGPIO FGPIOB             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_SPI_DATAOUT_GPIO GPIOB               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_SPI_DATAOUT_GPIO_PORT kGPIO_PORTE    /*!<@brief PORTB GPIO port: PORTB */
#define BOARD_INITPINS_SPI_DATAOUT_GPIO_PIN_MASK (1U << 1U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_SPI_DATAOUT_PORT PORTE               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SPI_DATAOUT_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SPI_DATAOUT_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

/*! @name PORTG7 (number 50), D4[3]/PTG7_BLUE
  @{ */

