qu1j0t3/yamaha_dac_y3014b/board/pin_mux.h
/*! @name PORTB7 (number 13), EXTAL
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITOSCPINS_EXTAL_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITOSCPINS_EXTAL_PIN 7U                   /*!<@brief PORT pin number */
#define BOARD_INITOSCPINS_EXTAL_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PORTB6 (number 14), XTAL
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITOSCPINS_XTAL_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITOSCPINS_XTAL_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_INITOSCPINS_XTAL_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitOSCPins(void);

#define SOPT0_CLKOE_0b0 0x00u /*!<@brief Bus Clock Output Enable: Bus clock output is disabled on PTH2. */

/*! @name PORTE7 (number 6), J5[5]/U7[1]/PTE7_CONN/CAN_TX
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITCANPINS_CAN_TX_PORT PORTE               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITCANPINS_CAN_TX_PIN 7U                   /*!<@brief PORT pin number */
#define BOARD_INITCANPINS_CAN_TX_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PORTH2 (number 7), J5[4]/U7[4]/PTH2_CONN/CAN_RX
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITCANPINS_CAN_RX_PORT PORTH               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITCANPINS_CAN_RX_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_INITCANPINS_CAN_RX_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitCANPins(void);

/*! @name PORTB1 (number 41), J1[4]/PTB1_IRTX
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITINFRAREDPINS_IRTX_FGPIO FGPIOA             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITINFRAREDPINS_IRTX_GPIO GPIOA               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITINFRAREDPINS_IRTX_GPIO_PORT kGPIO_PORTB    /*!<@brief PORTA GPIO port: PORTA */
#define BOARD_INITINFRAREDPINS_IRTX_GPIO_PIN_MASK (1U << 9U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITINFRAREDPINS_IRTX_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITINFRAREDPINS_IRTX_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_INITINFRAREDPINS_IRTX_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*! @name PORTA1 (number 61), J1[10]/PTA1_D4_T1/PTA1_IRRX
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITINFRAREDPINS_IRRX_FGPIO FGPIOA             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITINFRAREDPINS_IRRX_GPIO GPIOA               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITINFRAREDPINS_IRRX_GPIO_PORT kGPIO_PORTA    /*!<@brief PORTA GPIO port: PORTA */
#define BOARD_INITINFRAREDPINS_IRRX_GPIO_PIN_MASK (1U << 1U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITINFRAREDPINS_IRRX_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITINFRAREDPINS_IRRX_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_INITINFRAREDPINS_IRRX_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitINFRAREDPins(void);

/*! @name PORTF4 (number 38), PTF4_THER
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITTHERPINS_THER_A_PORT PORTF               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITTHERPINS_THER_A_PIN 4U                   /*!<@brief PORT pin number */
#define BOARD_INITTHERPINS_THER_A_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*! @name PORTF5 (number 37), PTF5_THER
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITTHERPINS_THER_B_PORT PORTF               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITTHERPINS_THER_B_PIN 5U                   /*!<@brief PORT pin number */
#define BOARD_INITTHERPINS_THER_B_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitTHERPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
